app/Http/Controllers/API/QuestionsCategoryController.php

SELECT * FROM "questions_categories" WHERE "questions_categories"."deleted_at" IS NULL ORDER BY "name" ASC
SELECT * FROM "questions_categories" WHERE "questions_categories"."deleted_at" IS NULL ORDER BY "name" ASC LIMIT 8 offset 0
SELECT count(*) as aggregate FROM "questions_categories" WHERE "questions_categories"."deleted_at" IS NULL
---
    public function index(Request $request, Api $api)
    {
        $question_categories = Questions_category::orderBy('name');

        if ($request->input('search')) {
            $question_categories
                ->where('name', 'like', '%' . $request->input('search') . '%');
        }

        if (count($request->input()) == 0) {
            $data = $question_categories->get();
        } else {
            $data = $question_categories->paginate(8);

UPDATE "questions_categories" SET "name" = 'kapet a', "updated_at" = '2022-09-30 00:58:03' WHERE "id" = 11 and "questions_categories"."deleted_at" IS NULL
---
    public function update(Request $request, Api $api, Questions_category $questions_category)
    {
        $validate = $this->validation('update', $request);
        if ($validate->fails()) {
            return $api->errorValidation($validate);
        }

        $data = [
            'name'          => $request->input('name'),
        ];

        $result = Questions_category::where('id', $questions_category->id)->update($data);