app/Http/Controllers/API/QuestionController.php

    public function index(Request $request, Api $api)
    {
        $questions = Question::join('questions_categories', 'questions_categories.id', 'questions.questions_categorie_id')
            ->latest('questions.created_at')
            ->select('questions.*', 'questions_categories.name as question_category_name');

        if ($request->input('search')) {
            $questions
                ->where('questions.name', 'like', '%' . $request->input('search') . '%')
                ->orwhere('questions_categories.name', 'like', '%' . $request->input('search') . '%');
        }

        if (count($request->input()) == 0) {
            $data = $questions->get();
        } else {
            $data = $questions->paginate(8);
---
SELECT "questions".*, "questions_categories"."name" as "question_category_name" FROM "questions" inner join "questions_categories" on "questions_categories"."id" = "questions"."questions_categorie_id" WHERE "questions"."deleted_at" IS NULL ORDER BY "questions"."created_at" DESC
SELECT "questions".*, "questions_categories"."name" as "questions_categorie_name" FROM "questions" inner join "questions_categories" on "questions_categories"."id" = "questions"."questions_categorie_id" WHERE "questions"."deleted_at" IS NULL ORDER BY "questions"."created_at" DESC LIMIT 8 offset 0
SELECT count(*) as aggregate FROM "questions" inner join "questions_categories" on "questions_categories"."id" = "questions"."questions_categorie_id" WHERE "questions"."deleted_at" IS NULL

    public function show(Api $api, Question $question)
    {
        $questions = $question::join('questions_categories', 'questions_categories.id', 'questions.questions_categorie_id')
            ->latest('questions.created_at')
            ->select('questions.*', 'questions_categories.name as question_category_name')
            ->where('questions.id', $question->id);
        $check_question = $questions->count();

        if ($check_question == 0) {
            return $api->responseError('Data not found');
        }

        $data = $questions->first();
---
SELECT count(*) as aggregate FROM "questions" inner join "questions_categories" on "questions_categories"."id" = "questions"."questions_categorie_id" WHERE "questions"."id" = 1 and "questions"."deleted_at" IS NULL
SELECT * FROM "questions" inner join "questions_categories" on "questions_categories"."id" = "questions"."questions_categorie_id" WHERE "questions"."id" = 1 and "questions"."deleted_at" IS NULL LIMIT 1