app/Http/Controllers/API/ReportController.php

SELECT * FROM "questions_categories" WHERE "questions_categories"."deleted_at" IS NULL
SELECT "reports".*, "respondents"."unit_id" as "respondents_unit_id", "respondents"."gender" as "respondents_gender", "respondents"."education" as "respondents_education", "units"."id" as "units_id", "units"."name" as "units_name", "questions"."name" as "questions_name", "questions"."questions_categorie_id" as "question_category" FROM "reports" inner join "respondents" on "respondents"."id" = "reports"."respondent_id" inner join "questions" on "questions"."id" = "reports"."question_id" inner join "units" on "units"."id" = "respondents"."unit_id" WHERE "units"."id" = 1 and "units"."id" = 2 and "units"."id" = 3 and "reports"."deleted_at" IS NULL ORDER BY "reports"."created_at" DESC
---
    public function report(Request $request, Api $api, Unit $unit, $date = null)
    {

        if ($date == null) {
            $date = date('m-Y', time());
        } else {
            $dates = explode('-', $date);
            if (strlen($dates[0]) > 2) {
                $month = $dates[1];
                $years = $dates[0];
            } else {
                $month = $dates[0];
                $years = $dates[1];
            }

            $date = date('m-Y', strtotime($years . '-' . $month));
            $date_query = date('Y-m', strtotime($years . '-' . $month));
        }

        ($unit->id == null) ? $unit->id = 1 : '';
        $question_category = Questions_category::get();
        $data = [];
        $data_respondent = [];
        $data_unit = [];

        array_push($data_unit, $unit::where('id', $unit->id)->get());
        foreach ($question_category as $key => $value) {
            $reports = Report::join('respondents', 'respondents.id', 'reports.respondent_id')
                ->join('questions', 'questions.id', 'reports.question_id')
                ->join('questions_categories', 'questions_categories.id', 'questions.questions_categorie_id')
                ->join('units', 'units.id', 'respondents.unit_id')
                ->latest('questions.questions_categorie_id')
                ->where('units.id', $unit->id)
                ->where('reports.created_at', 'like', '%' . $date_query . '%');