app/Http/Controllers/API/RespondentController.php

SELECT "respondents".*, "units"."name" as "units_name" FROM "respondents" inner join "units" on "units"."id" = "respondents"."unit_id" WHERE "respondents"."deleted_at" IS NULL ORDER BY "respondents"."created_at" DESC LIMIT 8 offset 0
SELECT count(*) as aggregate FROM "respondents" inner join "units" on "units"."id" = "respondents"."unit_id" WHERE "respondents"."deleted_at" IS NULL
---
    public function index(Request $request, Api $api)
    {
        $respondents = Respondent::join('units', 'units.id', 'respondents.unit_id')
            ->latest('respondents.created_at')
            ->select(
                'respondents.*',
                'units.name as units_name',
            );

        if ($request->input('search')) {
            $respondents
                ->where('units.name', 'like', '%' . $request->input('search') . '%')
                ->orwhere('respondents.gender', 'like', '%' . $request->input('search') . '%')
                ->orwhere('respondents.education', 'like', '%' . $request->input('search') . '%');
        }

        if (count($request->input()) == 0) {
            $data = $respondents->get();
        } else {
            $data = $respondents->paginate(8);