app/Http/Controllers/API/UnitController.php

SELECT * FROM "units" WHERE "units"."deleted_at" IS NULL ORDER BY "name" ASC
SELECT * FROM "units" WHERE "units"."deleted_at" IS NULL ORDER BY "name" ASC LIMIT 8 offset 0
SELECT count(*) as aggregate FROM "units" WHERE "units"."deleted_at" IS NULL
---
    public function index(Request $request, Api $api)
    {
        $units = Unit::orderBy('name');

        if ($request->input('search')) {
            $units
                ->where('name', 'like', '%' . $request->input('search') . '%');
        }

        if (count($request->input()) == 0) {
            $data = $units->get();
        } else {
            $data = $units->paginate(8);