app/Http/Controllers/HomeController.php

SELECT "respondents"."education" FROM "reports" inner join "respondents" on "respondents"."id" = "reports"."respondent_id" inner join "questions" on "questions"."id" = "reports"."question_id" inner join "questions_categories" on "questions_categories"."id" = "questions"."questions_categorie_id" inner join "units" on "units"."id" = "respondents"."unit_id" WHERE "units"."id" = '2' and "reports"."created_at"::text like '%2022%' and "reports"."deleted_at" IS NULL GROUP BY "respondents"."education"
---
            }


            $education = Report::join('respondents', 'respondents.id', 'reports.respondent_id')
                ->join('questions', 'questions.id', 'reports.question_id')
                ->join('questions_categories', 'questions_categories.id', 'questions.questions_categorie_id')
                ->join('units', 'units.id', 'respondents.unit_id')
                ->where('units.id', request()->input('unit'))
                ->where('reports.created_at', 'like', '%' . $filter . '%')
                ->select('respondents.education')->groupBy('respondents.education')->get();

SELECT "respondents"."education" FROM "reports" inner join "respondents" on "respondents"."id" = "reports"."respondent_id" inner join "questions" on "questions"."id" = "reports"."question_id" inner join "questions_categories" on "questions_categories"."id" = "questions"."questions_categorie_id" inner join "units" on "units"."id" = "respondents"."unit_id" WHERE "reports"."deleted_at" IS NULL GROUP BY "respondents"."education"
---
            }


            $education = Report::join('respondents', 'respondents.id', 'reports.respondent_id')
                ->join('questions', 'questions.id', 'reports.question_id')
                ->join('questions_categories', 'questions_categories.id', 'questions.questions_categorie_id')
                ->join('units', 'units.id', 'respondents.unit_id')
                ->select('respondents.education')->groupBy('respondents.education')->get();

SELECT * FROM "units" WHERE "units"."deleted_at" IS NULL
---
        ];

        // dd($graphic_report);
        $data = [
            'title'         => 'Dashboard',
            'app'           => 'SKM LIBAS',
            'author'        => '',
            'description'   => '',
            'state'         => 'read',
            'position'      => 'dashboard',
            'unit'          => Unit::get(),
            'report'        => json_decode(json_encode($data_report)),
            'report_graphics' => json_decode(json_encode($graphic_report)),
        ];