app/Http/Controllers/HomeController.php

            }


            $education = Report::join('respondents', 'respondents.id', 'reports.respondent_id')
                ->join('questions', 'questions.id', 'reports.question_id')
                ->join('questions_categories', 'questions_categories.id', 'questions.questions_categorie_id')
                ->join('units', 'units.id', 'respondents.unit_id')
                ->select('respondents.education')->groupBy('respondents.education')
                ->wherenull('reports.deleted_at')->get();
---
SELECT "respondents"."education" FROM "reports" inner join "respondents" on "respondents"."id" = "reports"."respondent_id" inner join "questions" on "questions"."id" = "reports"."question_id" inner join "questions_categories" on "questions_categories"."id" = "questions"."questions_categorie_id" inner join "units" on "units"."id" = "respondents"."unit_id" WHERE "reports"."deleted_at" IS NULL and "reports"."deleted_at" IS NULL GROUP BY "respondents"."education"

            'description'   => '',
            'state'         => 'read',
            'position'      => 'dashboard',
            'unit'          => Unit::get(),
---
SELECT * FROM "units" WHERE "units"."deleted_at" IS NULL