app/Http/Controllers/QuestionController.php

    public function index(Request $request, Api $api)
    {
        $questions = Question::join('questions_categories', 'questions_categories.id', 'questions.questions_categorie_id')
            ->latest('questions.created_at')
            ->select('questions.*', 'questions_categories.name as questions_categorie_name');

        if ($request->input('search')) {
            $questions
                ->where('questions.name', 'like', '%' . $request->input('search') . '%')
                ->orwhere('questions_categories.name', 'like', '%' . $request->input('search') . '%');
        }

        $data = [
            'title'                     => 'Pertanyaan',
            'app'                       => 'SKM LIBAS',
            'author'                    => '',
            'description'               => '',
            'state'                     => 'read',
            'position'                  => 'pertanyaan',
            'question'                  => $questions->simplePaginate(8),
---
SELECT "questions".*, "questions_categories"."name" as "questions_categorie_name" FROM "questions" inner join "questions_categories" on "questions_categories"."id" = "questions"."questions_categorie_id" WHERE "questions"."deleted_at" IS NULL ORDER BY "questions"."created_at" DESC LIMIT 9 offset 0

    public function store(Request $request, Api $api)
    {
        $validate = $this->validation(false, $request);
        if ($validate->fails()) {
            return redirect('questions/create')->withErrors($validate)->withInput();
        }

        $data = [
            'questions_categorie_id'    => $request->input('questions_categorie_id'),
            'name'                      => $request->input('name'),
        ];

        $result = Question::create($data);
---
INSERT INTO "questions" ("questions_categorie_id", "name", "updated_at", "created_at") VALUES ('3', 'pertanyaan 4', '2022-10-03 03:09:32', '2022-10-03 03:09:32') returning "id"

    public function edit(Api $api, Question $question, Request $request)
    {
        $questions = $question::where('id', $question->id);
        $check_questions = $question->count();

        $data = [
            'title'                     => 'Perbarui Pertanyaan',
            'app'                       => 'SKM LIBAS',
            'author'                    => '',
            'description'               => '',
            'state'                     => 'update',
            'position'                  => 'pertanyaan',
            'questions_category'        => Questions_category::get(),
            'question_count'            => $check_questions,
            'question'                  => $questions->first(),
        ];
---
SELECT count(*) as aggregate FROM "questions_categories" WHERE "id" = '3'
SELECT count(*) as aggregate FROM "questions" WHERE "questions"."deleted_at" IS NULL
SELECT * FROM "questions_categories" WHERE "questions_categories"."deleted_at" IS NULL
SELECT * FROM "questions" WHERE "id" = 3 and "questions"."deleted_at" IS NULL LIMIT 1

    public function update(Request $request, Api $api, Question $question)
    {
        $validate = $this->validation('update', $request);
        if ($validate->fails()) {
            return redirect('questions/' . $question->id . '/edit')->withErrors($validate)->withInput();
        }

        $data = [
            'questions_categorie_id' => $request->input('questions_categorie_id'),
            'name'                  => $request->input('name'),
        ];

        $result = Question::where('id', $question->id)->update($data);
---
UPDATE "questions" SET "questions_categorie_id" = '3', "name" = 'pertanyaan 4', "updated_at" = '2022-10-03 03:09:52' WHERE "id" = 4 and "questions"."deleted_at" IS NULL