app/Http/Controllers/QuestionsCategoryController.php

    public function index(Request $request)
    {
        $question_category = Questions_category::orderBy('name');

        if ($request->input('search')) {
            $question_category
                ->where('name', 'like', '%' . $request->input('search') . '%');
        }

        $data = [
            'title'                     => 'Kategori Pertanyaan',
            'app'                       => 'SKM LIBAS',
            'author'                    => '',
            'description'               => '',
            'state'                     => 'read',
            'position'                  => 'kategori pertanyaan',
            'question_category'         => $question_category->simplePaginate(8),
        ];
---
SELECT * FROM "questions_categories" WHERE "questions_categories"."deleted_at" IS NULL ORDER BY "name" ASC LIMIT 9 offset 0