app/Http/Controllers/ReportController.php

        $reports_message = $reports_message[0] . ' ' . $reports_message[1] . ' ' . $reports_date;
        $reports->message = $reports_message;

        $data = [
            'title'                     => 'Laporan Kuesioner',
            'app'                       => 'SKM LIBAS',
            'author'                    => '',
            'description'               => '',
            'state'                     => 'read',
            'position'                  => 'laporan kuesioner',
            'unit'                      => Unit::get(),
            'report'                    => $reports->data,
            'report_graphic'            => $report_graphic,
            'unit_current'              => $unit->id,
            'date_current'              => $date,
        ];
---
SELECT * FROM "units" WHERE "units"."deleted_at" IS NULL