app/Http/Controllers/ReportController.php

SELECT * FROM "users" WHERE "users"."deleted_at" IS NULL ORDER BY "created_at" DESC
---
    public function edit(Report $report)
    {
        $check_report = $report::where('id', $report->id)->count();
        $reporta = $report::where('id', $report->id)->first();

        $data = [
            'title'                     => 'Perbarui Laporan Kuesioner',
            'app'                       => 'SKM LIBAS',
            'author'                    => '',
            'description'               => '',
            'state'                     => 'update',
            'position'                  => 'laporan kuesioner',
            'users'                     => Users::latest()->get(),
            'question'                  => Question::latest()->get(),
            'report_count'              => $check_report,
            'report'                    => $reporta,
        ];