app/Http/Controllers/RespondentController.php

    public function index(Request $request, Api $api)
    {
        $respondents = Respondent::join('units', 'units.id', 'respondents.unit_id')
            ->latest('respondents.created_at')
            ->select(
                'respondents.*',
                'units.name as units_name',
            );

        if ($request->input('search')) {
            $respondents
                ->where('units.name', 'like', '%' . $request->input('search') . '%')
                ->orwhere('respondents.gender', 'like', '%' . $request->input('search') . '%')
                ->orwhere('respondents.education', 'like', '%' . $request->input('search') . '%');
        }

        $data = [
            'title'                     => 'Responden',
            'app'                       => 'SKM LIBAS',
            'author'                    => '',
            'description'               => '',
            'state'                     => 'read',
            'position'                  => 'responden',
            'respondent'                => $respondents->simplePaginate(8),
---
SELECT "respondents".*, "units"."name" as "units_name" FROM "respondents" inner join "units" on "units"."id" = "respondents"."unit_id" WHERE "respondents"."deleted_at" IS NULL ORDER BY "respondents"."created_at" DESC LIMIT 9 offset 0

    public function store(Request $request, Api $api)
    {
        $validate = $this->validation(false, $request);
        if ($validate->fails()) {
            return redirect('respondents/create')->withErrors($validate)->withInput();
        }

        $data = [
            'unit_id'               => $request->input('unit_id'),
            'gender'                => $request->input('gender'),
            'education'             => $request->input('education'),
        ];

        $result = Respondent::create($data);
---
INSERT INTO "respondents" ("unit_id", "gender", "education", "updated_at", "created_at") VALUES ('1', 'L', 'coba ajahh', '2022-10-03 09:29:43', '2022-10-03 09:29:43') returning "id"

    public function edit(Respondent $respondent, Api $api, Request $request)
    {
        $respondents = $respondent::where('id', $respondent->id);
        $check_respondents = $respondents->count();

        $data = [
            'title'                     => 'Perbarui Responden',
            'app'                       => 'SKM LIBAS',
            'author'                    => '',
            'description'               => '',
            'state'                     => 'update',
            'position'                  => 'responden',
            'unit'                      => Unit::get(),
            'respondent_count'          => $check_respondents,
            'respondent'                => $respondents->first(),
        ];
---
SELECT count(*) as aggregate FROM "units" WHERE "id" = '2'
SELECT count(*) as aggregate FROM "respondents" WHERE "id" = 1 and "respondents"."deleted_at" IS NULL
SELECT * FROM "units" WHERE "units"."deleted_at" IS NULL
SELECT * FROM "respondents" WHERE "id" = 1 and "respondents"."deleted_at" IS NULL LIMIT 1

    public function update(Request $request, Api $api, Respondent $respondent)
    {
        $validate = $this->validation('update', $request);
        if ($validate->fails()) {
            return redirect('respondents/' . $respondent->id . '/edit')->withErrors($validate)->withInput();
        }

        $data = [
            'unit_id'               => $request->input('unit_id'),
            'gender'                => $request->input('gender'),
            'education'             => $request->input('education'),
        ];

        $result = Respondent::where('id', $respondent->id)->update($data);
---
UPDATE "respondents" SET "unit_id" = '2', "gender" = 'L', "education" = 'coba ajahh', "updated_at" = '2022-10-03 09:29:52' WHERE "id" = 6 and "respondents"."deleted_at" IS NULL