app/Http/Controllers/UnitController.php

    public function index(Request $request, Api $api)
    {
        $units = Unit::orderBy('name');

        if ($request->input('search')) {
            $units
                ->where('name', 'like', '%' . $request->input('search') . '%');
        }

        $data = [
            'title'         => 'Unit Fokus',
            'app'           => 'SKM LIBAS',
            'author'        => '',
            'description'   => '',
            'state'         => 'read',
            'position'      => 'unit fokus',
            'units'         => $units->simplePaginate(8),
---
SELECT * FROM "units" WHERE "units"."deleted_at" IS NULL ORDER BY "name" ASC LIMIT 9 offset 0