app/Http/Controllers/UsersController.php

    public function index(Request $request)
    {
        $user = Users::latest();

        if ($request->input('search')) {
            $user
                ->where('name', 'like', '%' . $request->input('search') . '%')
                ->orwhere('email', 'like', '%' . $request->input('search') . '%')
                ->orwhere('level', 'like', '%' . $request->input('search') . '%')
                ->orwhere('phone', 'like', '%' . $request->input('search') . '%')
                ->orwhere('gender', 'like', '%' . $request->input('search') . '%')
                ->orwhere('address', 'like', '%' . $request->input('search') . '%');
        }

        $data = [
            'title'         => 'Admin',
            'app'           => 'SKM LIBAS',
            'author'        => '',
            'description'   => '',
            'state'         => 'read',
            'position'      => 'admin',
            'users'         => $user->simplePaginate(8),
---
SELECT * FROM "users" WHERE "users"."deleted_at" IS NULL ORDER BY "created_at" DESC LIMIT 9 offset 0

            'profile_pic'   => $profile_pic,
        ];

        $result = Users::create($data);
---
INSERT INTO "users" ("id", "email", "password", "level", "name", "phone", "gender", "address", "date_born", "profile_pic", "updated_at", "created_at") VALUES ('2e498ef1474dcbc834374aa44964b04e', 'widasaputra1@gmail.com', '$2y$10$Tok3pLngicEFvAdHBLrwC.aNy/Aj2UuLiRHRGShK8dNKUI9hQeGv2', 'superadmin', 'Royzan Wida Saputra', '1231231231', 'L', 'disana', '2022-02-02', '1665047955_wdSzlbIkUwa0ax2FpQfalNk682heJ3ANFaajIvcv.png', '2022-10-06 16:19:16', '2022-10-06 16:19:16')

    public function show(Users $user)
    {
        $check_users = $user::where('id', $user->id)->count();
        $data = [
            'title'         => 'Perbarui Admin',
            'app'           => 'SKM LIBAS',
            'author'        => '',
            'description'   => '',
            'state'         => 'update',
            'position'      => 'admin',
            'users_count'   => $check_users,
            'users'         => $user::where('id', $user->id)->first(),
            'login_history' => $user::join('login_histories', 'login_histories.user_id', 'users.id')->where('login_histories.user_id', $user->id)->get(),
---
SELECT * FROM "users" WHERE "id" = '1905d5208124d856d14b5326727b402e' and "users"."deleted_at" IS NULL LIMIT 1
SELECT * FROM "users" inner join "login_histories" on "login_histories"."user_id" = "users"."id" WHERE "login_histories"."user_id" = '1905d5208124d856d14b5326727b402e' and "users"."deleted_at" IS NULL

    public function change_passwd(Request $request, Users $user)
    {
        $validate = $this->validation('password', $request);
        if ($validate->fails()) {
            return redirect('users/' . $user->id . '/change_password')->withErrors($validate)->withInput();
        }

        $data = [
            'password'      => bcrypt($request->input('password')),
        ];

        $result = Users::where('id', $user->id)->update($data);
---
UPDATE "users" SET "remember_token" = '3JMpkZmvtXbYqNLIJU2DvrwNq3VvIojqhoYXzHDJqADDTtmjIZvArnP9nZhm' WHERE "id" = 'bf5d0cfb8dea2d72859dbf1ce4a5c2fe'
SELECT * FROM "users" WHERE "id" = 'bf5d0cfb8dea2d72859dbf1ce4a5c2fe' LIMIT 1

    public function logout(Request $request)
    {
        LoginHistory::create(['user_id' => auth()->user()->id, 'description' => 'logout']);
---
INSERT INTO "login_histories" ("user_id", "description", "updated_at", "created_at") VALUES ('bf5d0cfb8dea2d72859dbf1ce4a5c2fe', 'logout', '2022-10-06 12:51:02', '2022-10-06 12:51:02') returning "id"

    public function login(Request $request)
    {
        $validate = $this->validation('login', $request);
        if ($validate->fails()) {
            return redirect(url('login'))->withErrors($validate)->withInput();
        }

        $remember_me = ($request->input('remember_me') == 1) ? true : false;
        $csrf = csrf_token();
        $data = [
            'email'         => $request->input('email'),
            'password'      => $request->input('password'),
        ];
        $data_cookie_a = [
            'name'      => 'satrio_n_w_remember-me',
            'value'     => $request->input('email')
        ];

        if (auth()->attempt($data, $remember_me) == true) {
            $cookie = new Cookie;
            $request->session()->regenerate();
            $cookie->create($data_cookie_a, 'year');
            $result = LoginHistory::create(['user_id' => auth()->user()->id, 'description' => 'login']);
---
INSERT INTO "login_histories" ("user_id", "description", "updated_at", "created_at") VALUES ('372f17fddb9950f7b41eb55d540db86e', 'login', '2022-09-30 02:42:56', '2022-09-30 02:42:56') returning "id"

    public function id_generate()
    {
        $main = md5(Str::random(255));
        $check = Users::where('id', $main)->count();
---
SELECT count(*) as aggregate FROM "users" WHERE "id" = '2e498ef1474dcbc834374aa44964b04e' and "users"."deleted_at" IS NULL